------------------------------------------------------국가
INSERT INTO Country VALUES (Country_seq.nextVal, '한국');
INSERT INTO Country VALUES (Country_seq.nextVal, '미국');
INSERT INTO Country VALUES (Country_seq.nextVal, '일본');
INSERT INTO Country VALUES (Country_seq.nextVal, '프랑스');
INSERT INTO Country VALUES (Country_seq.nextVal, '중국');
INSERT INTO Country VALUES (Country_seq.nextVal, '뉴질랜드');
INSERT INTO Country VALUES (Country_seq.nextVal, '영국');
INSERT INTO Country VALUES (Country_seq.nextVal, '홍콩');


commit;
rollback;
select * from synopsis;
-- 시놉시스
insert into SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['가장 초라했던 그때,
가장 눈부시던 우리

고향 가는 고속버스에 올라탄 은호(구교환)와
휴학 후 어디론가 떠날 결심을 한 정원(문가영),
나란히 앉게 된 두 사람은 뜻밖의 인연을 맺는다.

서로의 꿈을 응원하며 의지하던 두 사람은
어느새 일상 깊숙이 스며들어 연인으로 발전한다.

웃고, 싸우고, 화해하며 세상을 다 가진 듯 뜨겁게 사랑하지만,
현실의 벽 앞에 두 사람은 결국 다른 길을 선택하게 된다.

그렇게 10년이 지난 후, 다시 마주한 순간
은호는 정원에게 오랫동안 묻어두었던 한마디를 꺼낸다.
']');

INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['대북제재로 돈줄이 막힌 북한.
국제사회의 2억 달러 지원을 얻기 위한 마지막 방법은 단 하나!
보위부는 당의 명령을 받고, 북한 최초의 가짜 찬양단을 만드는 임무를 맡는다.']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['월드 와이드 흥행 불멸의 1위 <아바타> 시리즈의 세 번째 이야기!
판도라를 위협하는 재의 부족, 더 이상 인간만이 적이 아니다!
12월, 모두의 운명을 뒤흔들 거대한 전투가 시작된다!

인간들과의 전쟁으로 첫째 아들 ‘네테이얌’을 잃은 후,
‘제이크’와 ‘네이티리’는 깊은 슬픔에 빠진다.

상실에 빠진 이들 앞에 ‘바랑’이 이끄는 재의 부족이 등장하면서,
판도라는 더욱 큰 위험에 빠지게 되고, ‘설리’ 가족은 선택의 기로에 서게 되는데…

역대급 스케일과 액션, 오직 <아바타>만이 선사할
압도적 시네마틱 경험을 반드시 극장에서 확인하라!']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['화려한 도시 한가운데에서 다른 내일을 꿈꾸며 살아가던 미선과 도경.
하지만 그 희망마저 빼앗기고 벼랑 끝까지 내몰린 상황,
두 사람은 우연히 알게 된 검은 돈과 숨겨진 금괴를 훔쳐 새로운 기회를 만들고
돈과 금괴에 얽힌 이들이 미선과 도경을 뒤쫓기 시작하는데…']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['일곱 개의 빛이 하나로 모일 때,
비로소 어둠의 군주가 다시 깨어난다!

10년 후, 20살이 된 하리는 대학생활에 적응하느라 알바하느라 바쁜 시간을 보낸다.
예전과는 달라진 상황에 서운해 하던 신비는 결국 하리와 크게 다투게 된다.
그런 신비 앞에 나타난 ‘귀신헌터’ 채널의 안 PD가 신비를 스타로 만들어 주겠다고 유혹하고,
예상치 못한 반응과 함께 신비는 하루아침에 유명 스타가 된다.
신비가 세상에 모습을 드러내자 숨어살던 전 세계의 도깨비들이 하나 둘 세상 밖으로 나오고,
도깨비들은 광화문에 모여 ‘세계 도깨비 축제’를 연다.
화려한 축제를 즐기던 그 순간,
오랜 시간 잠들어 있던 어둠의 군주 ‘지하국대적’이 부활하고, 모두가 위험에 빠지고 마는데...!
과연 하리는 신비와의 우정을 되찾고, 세상을 구할 수 있을까?!']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['더 화려해진 세계, 더 넓어진 주토피아!
디즈니의 가~~장 사랑스러운 콤비 ‘주디’와 ‘닉’이 돌아온다!

미스터리한 뱀 ‘게리’가 나타난 순간,
주토피아가 다시 흔들리기 시작했다!

혼란에 빠진 도시를 구하기 위해
환상의 콤비 ‘주디’ 와 ‘닉’이 잠입 수사에 나서고
상상 그 이상의 진실과 위협을 마주하게 되는데...!

11월, 초특급 추적 어드벤처가 펼쳐진다!']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['돌아온 남자 승민(권상우)이 다시 만난 첫사랑을 놓치지 않기 위해 고군분투하지만,
그녀에게 절대 말할 수 없는 비밀이 생기며 벌어지는 코미디']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['전설의 공중도시 ‘라퓨타’를 향한
거대한 여정이 시작된다!

해적 일당의 습격으로 비행선 아래로 떨어지게 된 소녀 ‘시타’는
광산촌의 견습 기계공인 소년 ‘파즈’에 의해 목숨을 구하게 된다.
둘은 하늘을 나는 전설 속 ‘라퓨타’를 함께 찾기로 약속하지만
신비한 힘을 품은 ‘시타’의 비행석 목걸이를 노리는 군대와
무자비한 해적들에게 쫓겨 위기를 겪게 되는데…!']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['광활한 사막 한가운데에서 펼쳐지는 레이브 파티
그곳에서 루이스는 아들 에스테반과 함께 실종된 딸을 찾아 헤맨다.
하지만 곧 그 길은 신의 심판대로 이어지는데...

전례 없는 충격의 논쟁작
이 영화를 감당할 수 있는가
']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['“아직도 여기가 회사인 줄 아나 봐?”
퇴근 없는 지옥의 무인도에서 펼쳐지는 예측 불가 고자극 서바이벌 스릴러!

직장에서 인정받지 못해 괴로워하는 ‘린다’는 죽일 만큼 미운 상사 ‘브래들리’와
출장 도중 비행기 추락 사고로 인해 무인도에 단둘이 고립된다.

와이파이도, 인사팀도, 직급도 없는 야생의 섬에서
이들의 권력관계는 완전히 뒤집히게 되는데…!

1월 28일, 샘 레이미 감독의 뒤틀린 천국으로 초대합니다!']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['사랑은 그렇게 다시 기억된다.

조엘은 아픈 기억만을 지워준다는 라쿠나사를 찾아가
헤어진 연인 클레멘타인의 기억을 지우기로 결심한다.
기억이 사라져 갈수록 조엘은 사랑이 시작되던 순간, 행복한 기억들,
가슴 속에 각인된 추억들을 지우기 싫어지기만 하는데...
당신을 지우면 이 아픔도 사라질까요?
사랑은 그렇게 다시 기억된다.']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['나는 오늘, 언니를 납치했다!

동생의 수술 비용을 마련하기 위해 거액의 돈이 필요한 ‘해란’(정지소)은
‘태수’(이수혁)와 이복언니 ‘소진’(차주영)을 납치한다.
눈 떠보니 낯선 공간에 감금된 ‘소진’.
‘해란’과 ‘태수’는 부잣집 딸 ‘소진’의 몸값으로 10억 원을 요구한다.
납치범 ‘해란’이 이복동생이라는 사실을 알게 된 ‘소진’은
언니와 동생, 피해자와 가해자라는 위태로운 공조를 시작하고
무자비한 ‘태수’를 상대로 반격을 가하는데…

하나씩 드러나는 진실, 끝이 없는 의심의 덫이 시작된다!']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['전 세계 350만 부 이상 판매된 고자극 반전 스릴러!
뉴욕타임스 130주, 아마존 83주 연속 베스트셀러 원작!

과거를 숨긴 채 상류층의 저택에서 일하게 된 수상한 가정부 밀리.
화려한 저택에 입주해 살게 됐다는 기쁨도 잠시,
처음에는 친절했지만 점점 이상한 행동을 하는 비밀스러운 아내 니나에게 질려간다.
그리고 그때마다 자신을 도와주는 이상적인 남편 앤드루에게 호감을 갖기 시작한다.

완벽한 저택 안에서 세 사람의 관계는 은밀하게 얽히고,
점차 닫힌 문 뒤 숨겨져 있던 거짓이 드러나기 시작하는데…']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['“나는 이제 어디로 갑니까…”

계유정난이 조선을 뒤흔들고
어린 왕 이홍위는 왕위에서 쫓겨나 유배길에 오른다.

“무슨 수를 쓰더라도 그 대감을 우리 광천골로 오게 해야지”

한편, 강원도 영월 산골 마을 광천골의 촌장 엄흥도는
먹고 살기 힘든 마을 사람들을 위해 청령포를 유배지로 만들기 위해 노력한다.
그러나 촌장이 부푼 꿈으로 맞이한 이는 왕위에서 쫓겨난 이홍위였다.
유배지를 지키는 보수주인으로서 그의 모든 일상을 감시해야만 하는 촌장은
삶의 의지를 잃어버린 이홍위가 점점 신경 쓰이는데…

1457년 청령포, 역사가 지우려 했던 이야기
<왕과 사는 남자>']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['중국 북동부에서 일본 제국군 731부대가 자행한 세균 실험을 배경으로,
평범한 개인이 겪는 격동의 운명을 통해 감춰진 범죄의 실체를 폭로하는 잔혹 역사 영화']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['인간과 99% 동일한 DNA
성인 남성 2배의 괴력…
가족과 다름없던 침팬지 ‘벤’이 어딘가 이상하다

방학을 맞아 친구들과 함께 하와이 집으로 돌아온 ‘루시’는
오랫동안 가족과 함께 지내온 침팬지 ‘벤’과 재회한다.

‘루시’와 친구들은 아버지가 집을 비운 틈을 타 풀 파티를 열기로 하지만
갑자기 ‘벤’이 돌변, 잔혹한 공격과 함께 폭주를 시작한다.

도망칠 곳도, 도움을 청할 곳도 없는 상황.
‘벤’이 들어올 수 없는 유일한 공간, 수영장에 갇힌 ‘루시’와 친구들은
통제 불능이 된 ‘벤’의 광기 어린 폭주 속에서 필사의 생존을 시작하는데...']');

INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['위기에 처한 곤충들을 구하기 위해
고고다이노 대원들이 작아졌어요!

고고다이노 탐험대는 우르르 행성을 탐험하며
미지의 숲속 세계에 떨어지고, 아주 작은 곤충의 세계를 발견한다.
그곳에서 대원들은 곤경에 처한 무당벌레, 길을 잃은 개미 등
곤충 친구들을 구조하는 특별 임무를 맡게 되는데…
토모의 새로운 발명품 ‘작아져라 기계’로 곤충만큼 작아진 고고다이노 대원들!

지금까지 본 적 없던 곤충탐험대의 작지만 아주 큰 모험이 펼쳐진다!']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['매일 너의 기억을 채워주고 싶은 남자, 김재원(추영우)

학교를 가도 아무 의욕이 없던 나에게
어느 순간, 웃을 때마다 빛나는 긴 머리의 한 아이가
나의 심장 속에 들어오기 시작했다.

“시간이 지날수록 다른 건 다 모르겠고, 그냥 보고 싶기만 해.”

매일 나의 기억을 잃어버리는 여자, 한서윤(신시아)

매일 기억이 리셋되어 모든 것을 기록해야 하는 하루가 고단했던 나에게
키 크고 눈빛이 잊히지 않는 한 아이가
나의 기억 속에 들어오기 시작했다.

“안 하던 짓 좀 해보려고. 안 그럼 너무 지루하잖아.”

오늘 밤, 세계에서 이 사랑이 사라진다 해도
내일의 너를 다시 사랑할 거야']');
INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['“카미야 토루에 대해 잊지 말 것”

자고 일어나면 전날의 기억을 잃는
‘선행성 기억상실증’에 걸린 소녀 ‘마오리’

“내일의 마오리도 내가 즐겁게 해줄 거야”

누구에게도 기억되지 않는
무색무취의 평범한 소년 ‘토루’

매일 밤 사랑이 사라지는 세계,
그럼에도 불구하고,
다음 날 서로를 향한 애틋한 고백을 반복하는
두 소년, 소녀의 가장 슬픈 청춘담']');

INSERT INTO SYNOPSIS VALUES (SYNOPSIS_SEQ.NEXTVAL, q'['1형 당뇨 판정을 받은 어린 아들 ‘동명’을 위해 고군분투하다
세상을 바꾸어 버린 엄마의 이야기']');



-- 심의등급 insert
INSERT INTO MOVIE_RATING VALUES (RATING_SEQ.nextval, '전체 관람가');
INSERT INTO MOVIE_RATING VALUES (RATING_SEQ.nextval, '12세이상관람가');
INSERT INTO MOVIE_RATING VALUES (RATING_SEQ.nextval, '15세이상관람가');
INSERT INTO MOVIE_RATING VALUES (RATING_SEQ.nextval, '청소년 관람불가');

select * from movie_rating;